%%%%%%%%%%%%%%%%%%%%此程序为黄耿第自创，敬请指出不足之处或共同探讨，随意借鉴，但谢绝抄袭%%%%%%%%%%%%%%%%%%%%%
function [key] = miyaodes(K,n)%%%%%%%%%%%%%生成密钥函数，其中K为密文，n为迭代的次数，供des函数调用%%%
k=zeros(1,56);   %初始化56bits密钥
keyy=zeros(1,48);%%初始化中间变量
key=zeros(1,48);%%初始化48bits密钥
PC1=[57,49,41,33,25,17,9,1,58,50,42,34,26,18,10,2,59,51,43,35,27,19,11,3,60,52,44,36,63,55,47,39,31,23,15,7,62,54,46,38,30,22,14,6,61,53,45,37,29,21,13,5,28,20,12,4];
PC2=[14,17,11,24,1,5,3,28,15,6,21,10,23,19,12,4,26,8,16,7,27,20,13,2,41,52,31,37,47,55,30,40,51,45,33,48,44,49,39,56,34,53,46,42,50,36,29,32];
for i=1:56  %%%%%%%%%%%%%%%%%%%%%%%%%%此for循环执行PC-1换位
    k(i)=K(PC1(i));
end
C=k(1:28);%%%%%
D=k(29:56);%%%%分开为C和D两个序列
LL=[1 1 2 2 2 2 2 2 1 2 2 2 2 2 2 1];
C=C([sum(LL(1:n))+1:28,1:sum(LL(1:n))]);%%%%根据n（既第几次密钥）进行移位
D=D([sum(LL(1:n))+1:28,1:sum(LL(1:n))]);%%%%
keyy=[C,D]; %%%%重排
for i=1:48%%%%%%%%%%%%%%%%%%%%%此for循环完成PC2变换，得到本次miyaodes函数的最终结果
    key(i)=keyy(PC2(i));
end


    